Autodesk.Navisworks.Api.Plugins.DockPanePluginAttribute
Optional attribute for use with an DockPanePlugin derived class.
If this attribute is not used, the default values are the same as using a DockPanePluginAttribute(100,100)

Autodesk.Navisworks.Api.Plugins.DockPanePluginAttribute.#ctor(System.Int32,System.Int32)
Constructor DockPanePluginAttribute, takes a pair of values that specify the prefered size for the pane. Default values are:
MinimumWidth=0,
MinimumHeight=0,
AutoScroll=true,
FixedSize=true.
preferredWidth:
The preferred width
preferredHeight:
The preferred height

Autodesk.Navisworks.Api.Plugins.DockPanePluginAttribute.AutoScroll
Determines if scroll bars should appear when the pane gets bellow it's minimum size

Autodesk.Navisworks.Api.Plugins.DockPanePluginAttribute.FixedSize
Determines if the pane should be resizable

Autodesk.Navisworks.Api.Plugins.DockPanePluginAttribute.MinimumHeight
Minimum height of pane, 0 means no preference

Autodesk.Navisworks.Api.Plugins.DockPanePluginAttribute.MinimumWidth
Minimum width of pane, 0 means no preference

Autodesk.Navisworks.Api.Plugins.DockPanePluginAttribute.PreferredHeight
Preferred height of pane, 0 means no preference

Autodesk.Navisworks.Api.Plugins.DockPanePluginAttribute.PreferredWidth
Preferred width of pane, 0 means no preference